---
kind: type
id: T:Autodesk.Revit.DB.WireframeBuilder
source: html/ae9e719b-5d13-45c5-22d8-49111edfcfc4.htm
---
# Autodesk.Revit.DB.WireframeBuilder

Constructs a shape representation consisting of points and curves. That shape would typically be stored in a DirectShape or a DirectShapeType object.

## Syntax (C#)
```csharp
public class WireframeBuilder : ShapeBuilder
```